Revit 2026 API

# ElectricalSystemTrueCurrentPhaseA Property

---

The TrueCurrentPhaseA value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TrueCurrentPhaseA { get; }
```
```vb
Public ReadOnly Property TrueCurrentPhaseA As Double
	Get
```
```cpp
public:
property double TrueCurrentPhaseA {
	double get ();
}
```
```fsharp
member TrueCurrentPhaseA : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the TrueCurrentPhaseA value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace